In [73]:
import config as cf

import pandas as pd

import matplotlib.pyplot as plt

import sqlalchemy

from sqlalchemy.orm import session

from sqlalchemy.ext.automap import automap_base

In [74]:
from sqlalchemy import create_engine
engine = create_engine(f'postgresql+psycopg2://postgres:{cf.password}@localhost:{cf.port}/employee')
conn = engine.connect()

In [79]:
# SQL code
#Select e.emp_no, s.salary
#From employees as e 
#Inner JOIN salaries as s
#ON e.emp_no = s.emp_no

In [89]:
#https://medium.com/analytics-vidhya/introduction-to-sql-using-python-using-join-statements-to-merge-multiple-tables-3b3513fe2c98

employee_df = pd.read_sql('SELECT e.emp_no, s.salary FROM employee as e INNER JOIN salaries as s ON e.emp_no = s.emp_no', conn)

In [90]:
employee_df.head()

   emp_no  salary
0   10001   60117
1   10005   78228
2   10010   72488
3   10011   42365
4   10013   40000

In [ ]:
# Create a histogram to visualize the most common salary ranges for employees.